<?php
// +----------------------------------------------------------------------
// |  [ 我的梦想是星辰大海 ]
// +----------------------------------------------------------------------
// | Author: yc  and yc@yuanxu.top
// +----------------------------------------------------------------------
// | Date: 2018/11/19 Time: 9:26
// +----------------------------------------------------------------------


/**
 * 异常处理基类
 */
namespace app\lib\exception;
use think\Exception;

class BaseExcepiton extends Exception {

    // HTTP 状态码 404,200
    public $code = 400;

    public $msg = '参数错误';

    public $errorCode = 10000;

}